!function(e, t) {
  if ("object" == typeof exports && "object" == typeof module)
    module.exports = t();
  else if ("function" == typeof define && define.amd)
    define([], t);
  else {
    var r = t();
    for (var p in r)
      ("object" == typeof exports ? exports : e)[p] = r[p]
  }
}(self, (function() {
    return function() {
      var e = {
        545: function(e, t, r) {
          r(274);
          e.exports = function(e) {
            "use strict";
            e = e || {};
            return '<div><div class="protocol-box"><div class="p-stress">请认真阅读并理解以下内容，其中以加粗方式显著标识的文字，请着重阅读、慎重考虑。</div><p class="agree-text">本协议是您与京东网站（简称"本站"，网址：www.jd.com）所有者（以下简称为"京东"）之间就京东PLUS会员所订立的契约。请您仔细阅读本协议，您勾选"<span class="agreeAnd">已阅读并同意</span>"选项后，本协议即构成对双方有约束力的法律文件。</p></div><div class="rule-box"><h3 class="agree-title">第1条 相关定义</h3><p><b>1.1京东PLUS会员：</b>京东PLUS会员是为京东客户打造的高级会员服务，通过提供高品质的客户服务，让网购变的更加方便，省钱和放心。</p><p><b>1.2京东PLUS会员正式期：</b>完成实名认证且具有良好信用价值和消费记录的京东个人用户，可享受PLUS会员正式期开通资格，并可享受京东所提供的相关服务。</p><p><b>1.3京东PLUS会员试用期：</b>完成实名认证且具有良好信用价值和消费记录的京东个人用户，可享受试用30天京东PLUS会员资格，并可享受京东所提供的相关服务。试用期内或试用期结束后用户可选择购买正式版京东PLUS会员资格，如购买时尚在试用期内，则试用期自付款之日结束。</p><p><b>1.4自动续费服务：</b>指网银在线（北京）科技有限公司（以下简称“网银在线”）根据您的授权，执行您因京东PLUS会员会费委托京东PLUS会员的交易相对方所在平台/网站（以下简称“京东”）向网银在线发起的扣款指令，从而为您提供的支付服务。基于权益调整、市场与业务的发展，PLUS会员可能会调整会员开通所需会员服务费用，会员服务费用调整自公布之日起生效，您于生效前已开通的PLUS会员服务不受影响，但该PLUS会员服务到期后若需续费开通，则需按照调整后已生效的费用标准支付。</p><p><b>1.5实名信息：</b>用户开通PLUS会员需完成实名信息认证，同一自然人（即同一个实名信息）如有多个京东账号，同一时间内仅支持一个京东账号开通PLUS会员（包含但不限于PLUS正式会员、PLUS试用会员等）。</p></div><div class="rule-box"><h3 class="agree-title">第2条 本站服务条款的确认和接纳</h3><p>2.1本站所提供的<b>京东PLUS会员</b>试用期及正式期活动的所有权和运作权归京东所有。</p><p>2.2用户点击同意本协议的，即视为用户确认自己同意接受京东PLUS会员相关服务的条款，且同意按本协议内容履行，如产生用户相关责任的，同意承担相应法律责任。</p><p>2.3如果您在18周岁以下，您只能在父母或监护人的监护参与下方能参与体验该服务。</p><p>2.4京东保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容等相关权利。</p><p><b>2.5您同意并理解，如领取PLUS试用权益并开通自动续费服务，京东PLUS会员试用期结束后，您将自动获得京东PLUS年卡会员资格；如购买PLUS正式会员年卡或季卡并开通自动续费服务，PLUS会员资格到期后，您的PLUS会员资格将自动延期一年或一季。在上述情形下，您授权京东自动扣除一年期或一季期的京东PLUS会员会费。如您不希望购买京东PLUS会员正式资格，或者您已具有京东PLUS会员正式资格但不想对京东PLUS会员资格续期，或者您不希望自动扣款，则您应在京东收取PLUS会员会费前指定时间内，通知京东您的决定。</b></p><p><b>2.6 PLUS会费扣取有自动续费功能，本公司会在扣款前3日短信通知您。请您留意扣款通知。</b></p><p><b>2.7 京东PLUS会员开通后，您在已开通的服务期内中途主动取消服务或终止资格的，如满足7天无忧退款条件，则可获得相应退款；如不满足7天无忧退款条件，将不获得为开通本服务而支付费用的退还。7天无忧退款规则详细见《7天无忧退款服务》。</b></p></div><div class="rule-box"><h3 class="agree-title">第3条 京东PLUS会员权益</h3><p>您成为京东PLUS正式期或试用期会员后，可享受的正式期或试用期会员权益以京东官方网站公布的信息为准。为更好的向会员提供服务，京东有权基于自身业务发展需要调整全部或部分会员权益。京东就前述权益调整将在相应服务页面进行通知或公告，您可以通过京东官方网站查询最新的会员权益内容。</p></div><div class="rule-box"><h3 class="agree-title">第4条 用户会员使用注意事项</h3><p>4.1提交申请开通时，用户同意并提交本人手机号码和邮箱等本站所需的个人资料，并保证其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽，用户需承担因此引起的相应责任及后果，并且京东保留终止用户参与该活动的权利。</p><p>4.2服务开通后，用户应谨慎合理的保存、使用其用户名和密码，不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，同时京东在该种情况下有权做出独立判断，可采取暂停或关闭用户参与资格等措施。</p><p>4.3用户同意，京东拥有通过邮件、短信电话等形式，向其发送相关活动信息等必要信息的权利。</p><p>4.4PLUS用户通过京东账号操作的各项行为应符合法律法规规定、平台规则规定及用户注册协议约定、京东PLUS会员正式用户协议，当出现违规行为（具体可参见：<a href="https://help.jd.com/user/issue/32-1199.html">违规行为处理规则</a>）、违规订单（具体可参见：<a href="https://help.jd.com/user/issue/399-1183.html">违规订单处理规则</a>）及违规账号（具体可参见：<a href="https://help.jd.com/user/issue/164-3445.html">违规账号处理规则</a>）时，京东有权按照上述平台内规则对您的账号和订单予以处理，如京东或商家会对您进行平台权益和PLUS会员权益降级，强制风险验证、扣除京豆、冻结或关闭京东账号、取消订单、暂停或停止提供服务、关闭PLUS会员开通资格、关停已开通的PLUS会员服务，已绑定的或获取的PLUS会员权益被全部/部分取消或暂停使用等操作，不退换已支付的会员服务费用，且不进行任何赔偿或补偿。如给京东或相关方造成损失，PLUS用户需承担全部责任。从公平合理的角度，您应知晓所有通过该账户实现的操作产生的全部后果由您自行承担。</p><p>4.5PLUS用户违规行为包含但不限于以下行为时，京东有权关闭您的PLUS会员开通资格、关停您已开通的PLUS会员服务，已绑定的或获取的PLUS会员权益被全部/部分取消或暂停使用，且不退换已支付的会员服务费用。从公平合理的角度，您应知晓所有通过该账户实现的操作产生的全部后果或损失由您自行承担。<br>1）利用PLUS会员服务进行盈利或非法获利；<br>2）以任何形式转让或转移PLUS会员服务或PLUS会员权益；<br>3）将PLUS会员服务或会员权益借给他人使用、代他人下单；<br>4）通过任何不正当手段或以违反城市信用原则的方式开通PLUS会员服务，如恶意绕过正常开通流程；<br>5）使用PLUS会员权益获取的商品或服务并非用于个人消费或使用；<br>6）同一用户注册、持有、使用或控制多个会员账号。其中，同一用户是指京东账户、手机号码、支付账号、身份证号码、设备号、注册信息、网络操作日志、交易订单信息等与用户身份和行为相关的信息，其中任意一项或数项存在相同、相似，亦或通过特定标记批量信息进行分析，其数项存在相同、相似的；<br>7）用户在使用会员服务时，存在利用秒杀器等工具下单、套取优惠利差、虚假下单交易、提供虚假交易信息等扰乱交易秩序、违反交易规则的行为；<br>8）经京东判断，PLUS用户行为不符合公平原则或诚实信用原则的情形。</p><p>4.6PLUS会员兑换码：即由京东提供的开通PLUS正式会员识别码，用户可在京东PLUS正式会员开通入口输入，系统识别成功后该账户便可享受相应期限的PLUS正式会员服务。<br>4.6.1PLUS会员兑换码使用规则：京东PLUS用户需实名认证后方可使用PLUS会员，同时，到期天数需低于486天、PLUS当年累计开通及兑换次数不超过2次（含包括季卡在内的所有卡种）且满足绑定条件时方可开通或续费。用户应严格遵守页面展示的PLUS会员兑换码使用规则，如有违反，用户应承担由此产生的全部责任，同时京东在该种情况下有权做出独立判断，可采取暂停或关闭用户参与资格等措施。<br>4.6.2每个京东PLUS会员兑换码仅限兑换一次，一经绑定，仅可用于被绑定的账户，不能解绑或换账户使用。<br>4.6.3PLUS会员兑换码一旦兑换，属个人所有，个人应妥善保管，京东不对京东PLUS会员兑换码的泄露、丢失、被盗等其他不能使用或不能激活的情况负责。<br>4.6.4用户通过正当途径获取的京东PLUS会员兑换码，不得进行销售。若发现立即冻结，兑换码置为失效，通过此码激活开通的账户也将终止PLUS会员资格，用户双方全部加入黑名单限制再次开通PLUS会员。</p></div><div class="rule-box"><h3 class="agree-title">第5条 协议更新及用户关注义务</h3><p>5.1根据国家法律法规变化及网站运营需要，<b>京东有权以网站公告的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦被公告在本站上即生效，并代替原来的协议。用户应及时关注不时发布的各项服务规则及本协议的变更。若不同意相关规则及条款修改的，应及时终止与本站的协议。如用户继续使用本网站提供的服务的，即视为同意更新后的协议。京东建议您在使用本站之前阅读本协议及本站的公告。</b></p></div><div class="rule-box"><h3 class="agree-title">第6条 法律管辖和适用</h3><p>京东有权以网站公告的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦被公告在本站上即生效，并代替原来的协议。用户应及时关注不时发布的各项服务规则及本协议的变更。若不同意相关规则及条款修改的，应及时终止与本站的协议。如用户继续使用本网站提供的服务的，即视为同意更新后的协议。京东建议您在使用本站之前阅读本协议及本站的公告。<b>如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向北京市大兴区人民法院提起诉讼。</b></p></div><div class="rule-box"><h3 class="agree-title">第7条 其他</h3><p>7.1京东网站所有者是指在政府部门依法许可或备案的京东网站经营主体。</p><p>7.2如因不可抗力或其它本站无法控制的原因使本站活动服务无法及时提供或无法按本协议进行的，京东会合理地尽力协助处理善后事宜。</p><p>7.3用户除遵守该用户协议外，仍应同时遵守《京东用户注册协议》。</p><p>7.4试用期自用户开通之日起，最长30天后自动终止。</p><p><b>7.5如用户购买PLUS联名卡，领取权益则视为同意并遵守联名会员用户协议。</b></p><p><b>7.6本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</b></p></div><div class="rule-box"><p>协议生效日期：2020年10月30日</p></div></div>',
              '<div><div class="protocol-box"><div class="p-stress">请认真阅读并理解以下内容，其中以加粗方式显著标识的文字，请着重阅读、慎重考虑。</div><p class="agree-text">本协议是您与京东网站（简称"本站"，网址：www.jd.com）所有者（以下简称为"京东"）之间就京东PLUS会员所订立的契约。请您仔细阅读本协议，您勾选"<span class="agreeAnd">已阅读并同意</span>"选项后，本协议即构成对双方有约束力的法律文件。</p></div><div class="rule-box"><h3 class="agree-title">第1条 相关定义</h3><p><b>1.1京东PLUS会员：</b>京东PLUS会员是为京东客户打造的高级会员服务，通过提供高品质的客户服务，让网购变的更加方便，省钱和放心。</p><p><b>1.2京东PLUS会员正式期：</b>完成实名认证且具有良好信用价值和消费记录的京东个人用户，可享受PLUS会员正式期开通资格，并可享受京东所提供的相关服务。</p><p><b>1.3京东PLUS会员试用期：</b>完成实名认证且具有良好信用价值和消费记录的京东个人用户，可享受试用30天京东PLUS会员资格，并可享受京东所提供的相关服务。试用期内或试用期结束后用户可选择购买正式版京东PLUS会员资格，如购买时尚在试用期内，则试用期自付款之日结束。</p><p><b>1.4自动续费服务：</b>指网银在线（北京）科技有限公司（以下简称“网银在线”）根据您的授权，执行您因京东PLUS会员会费委托京东PLUS会员的交易相对方所在平台/网站（以下简称“京东”）向网银在线发起的扣款指令，从而为您提供的支付服务。基于权益调整、市场与业务的发展，PLUS会员可能会调整会员开通所需会员服务费用，会员服务费用调整自公布之日起生效，您于生效前已开通的PLUS会员服务不受影响，但该PLUS会员服务到期后若需续费开通，则需按照调整后已生效的费用标准支付。</p><p><b>1.5实名信息：</b>用户开通PLUS会员需完成实名信息认证，同一自然人（即同一个实名信息）如有多个京东账号，同一时间内仅支持一个京东账号开通PLUS会员（包含但不限于PLUS正式会员、PLUS试用会员等）。</p></div><div class="rule-box"><h3 class="agree-title">第2条 本站服务条款的确认和接纳</h3><p>2.1本站所提供的<b>京东PLUS会员</b>试用期及正式期活动的所有权和运作权归京东所有。</p><p>2.2用户点击同意本协议的，即视为用户确认自己同意接受京东PLUS会员相关服务的条款，且同意按本协议内容履行，如产生用户相关责任的，同意承担相应法律责任。</p><p>2.3如果您在18周岁以下，您只能在父母或监护人的监护参与下方能参与体验该服务。</p><p>2.4京东保留在中华人民共和国大陆地区法施行之法律允许的范围内独自决定拒绝服务、关闭用户账户、清除或编辑内容等相关权利。</p><p><b>2.5您同意并理解，如领取PLUS试用权益并开通自动续费服务，京东PLUS会员试用期结束后，您将自动获得京东PLUS年卡会员资格；如购买PLUS正式会员年卡或季卡并开通自动续费服务，PLUS会员资格到期后，您的PLUS会员资格将自动延期一年或一季。在上述情形下，您授权京东自动扣除一年期或一季期的京东PLUS会员会费。如您不希望购买京东PLUS会员正式资格，或者您已具有京东PLUS会员正式资格但不想对京东PLUS会员资格续期，或者您不希望自动扣款，则您应在京东收取PLUS会员会费前指定时间内，通知京东您的决定。</b></p><p><b>2.6 PLUS会费扣取有自动续费功能，本公司会在扣款前3日短信通知您。请您留意扣款通知。</b></p><p><b>2.7 京东PLUS会员开通后，您在已开通的服务期内中途主动取消服务或终止资格的，如满足7天无忧退款条件，则可获得相应退款；如不满足7天无忧退款条件，将不获得为开通本服务而支付费用的退还。7天无忧退款规则详细见《7天无忧退款服务》。</b></p></div><div class="rule-box"><h3 class="agree-title">第3条 京东PLUS会员权益</h3><p>您成为京东PLUS正式期或试用期会员后，可享受的正式期或试用期会员权益以京东官方网站公布的信息为准。为更好的向会员提供服务，京东有权基于自身业务发展需要调整全部或部分会员权益。京东就前述权益调整将在相应服务页面进行通知或公告，您可以通过京东官方网站查询最新的会员权益内容。</p></div><div class="rule-box"><h3 class="agree-title">第4条 用户会员使用注意事项</h3><p>4.1提交申请开通时，用户同意并提交本人手机号码和邮箱等本站所需的个人资料，并保证其提供的注册资料真实、准确、完整、合法有效，用户注册资料如有变动的，应及时更新其注册资料。如果用户提供的注册资料不合法、不真实、不准确、不详尽，用户需承担因此引起的相应责任及后果，并且京东保留终止用户参与该活动的权利。</p><p>4.2服务开通后，用户应谨慎合理的保存、使用其用户名和密码，不得将在本站注册获得的账户借给他人使用，否则用户应承担由此产生的全部责任，同时京东在该种情况下有权做出独立判断，可采取暂停或关闭用户参与资格等措施。</p><p>4.3用户同意，京东拥有通过邮件、短信电话等形式，向其发送相关活动信息等必要信息的权利。</p><p>4.4PLUS用户通过京东账号操作的各项行为应符合法律法规规定、平台规则规定及用户注册协议约定、京东PLUS会员正式用户协议，当出现违规行为（具体可参见：<a href="https://help.jd.com/user/issue/32-1199.html">违规行为处理规则</a>）、违规订单（具体可参见：<a href="https://help.jd.com/user/issue/399-1183.html">违规订单处理规则</a>）及违规账号（具体可参见：<a href="https://help.jd.com/user/issue/164-3445.html">违规账号处理规则</a>）时，京东有权按照上述平台内规则对您的账号和订单予以处理，如京东或商家会对您进行平台权益和PLUS会员权益降级，强制风险验证、扣除京豆、冻结或关闭京东账号、取消订单、暂停或停止提供服务、关闭PLUS会员开通资格、关停已开通的PLUS会员服务，已绑定的或获取的PLUS会员权益被全部/部分取消或暂停使用等操作，不退换已支付的会员服务费用，且不进行任何赔偿或补偿。如给京东或相关方造成损失，PLUS用户需承担全部责任。从公平合理的角度，您应知晓所有通过该账户实现的操作产生的全部后果由您自行承担。</p><p>4.5PLUS用户违规行为包含但不限于以下行为时，京东有权关闭您的PLUS会员开通资格、关停您已开通的PLUS会员服务，已绑定的或获取的PLUS会员权益被全部/部分取消或暂停使用，且不退换已支付的会员服务费用。从公平合理的角度，您应知晓所有通过该账户实现的操作产生的全部后果或损失由您自行承担。<br>1）利用PLUS会员服务进行盈利或非法获利；<br>2）以任何形式转让或转移PLUS会员服务或PLUS会员权益；<br>3）将PLUS会员服务或会员权益借给他人使用、代他人下单；<br>4）通过任何不正当手段或以违反城市信用原则的方式开通PLUS会员服务，如恶意绕过正常开通流程；<br>5）使用PLUS会员权益获取的商品或服务并非用于个人消费或使用；<br>6）同一用户注册、持有、使用或控制多个会员账号。其中，同一用户是指京东账户、手机号码、支付账号、身份证号码、设备号、注册信息、网络操作日志、交易订单信息等与用户身份和行为相关的信息，其中任意一项或数项存在相同、相似，亦或通过特定标记批量信息进行分析，其数项存在相同、相似的；<br>7）用户在使用会员服务时，存在利用秒杀器等工具下单、套取优惠利差、虚假下单交易、提供虚假交易信息等扰乱交易秩序、违反交易规则的行为；<br>8）经京东判断，PLUS用户行为不符合公平原则或诚实信用原则的情形。</p><p>4.6PLUS会员兑换码：即由京东提供的开通PLUS正式会员识别码，用户可在京东PLUS正式会员开通入口输入，系统识别成功后该账户便可享受相应期限的PLUS正式会员服务。<br>4.6.1PLUS会员兑换码使用规则：京东PLUS用户需实名认证后方可使用PLUS会员，同时，到期天数需低于486天、PLUS当年累计开通及兑换次数不超过2次（含包括季卡在内的所有卡种）且满足绑定条件时方可开通或续费。用户应严格遵守页面展示的PLUS会员兑换码使用规则，如有违反，用户应承担由此产生的全部责任，同时京东在该种情况下有权做出独立判断，可采取暂停或关闭用户参与资格等措施。<br>4.6.2每个京东PLUS会员兑换码仅限兑换一次，一经绑定，仅可用于被绑定的账户，不能解绑或换账户使用。<br>4.6.3PLUS会员兑换码一旦兑换，属个人所有，个人应妥善保管，京东不对京东PLUS会员兑换码的泄露、丢失、被盗等其他不能使用或不能激活的情况负责。<br>4.6.4用户通过正当途径获取的京东PLUS会员兑换码，不得进行销售。若发现立即冻结，兑换码置为失效，通过此码激活开通的账户也将终止PLUS会员资格，用户双方全部加入黑名单限制再次开通PLUS会员。</p></div><div class="rule-box"><h3 class="agree-title">第5条 协议更新及用户关注义务</h3><p>5.1根据国家法律法规变化及网站运营需要，<b>京东有权以网站公告的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦被公告在本站上即生效，并代替原来的协议。用户应及时关注不时发布的各项服务规则及本协议的变更。若不同意相关规则及条款修改的，应及时终止与本站的协议。如用户继续使用本网站提供的服务的，即视为同意更新后的协议。京东建议您在使用本站之前阅读本协议及本站的公告。</b></p></div><div class="rule-box"><h3 class="agree-title">第6条 法律管辖和适用</h3><p>京东有权以网站公告的方式进行不定期地制定、修改本协议及/或相关服务规则，暂停、取消和修改本协议条款，修改后的协议一旦被公告在本站上即生效，并代替原来的协议。用户应及时关注不时发布的各项服务规则及本协议的变更。若不同意相关规则及条款修改的，应及时终止与本站的协议。如用户继续使用本网站提供的服务的，即视为同意更新后的协议。京东建议您在使用本站之前阅读本协议及本站的公告。<b>如缔约方就本协议内容或其执行发生任何争议，双方应尽力友好协商解决；协商不成时，任何一方均可向北京市大兴区人民法院提起诉讼。</b></p></div><div class="rule-box"><h3 class="agree-title">第7条 其他</h3><p>7.1京东网站所有者是指在政府部门依法许可或备案的京东网站经营主体。</p><p>7.2如因不可抗力或其它本站无法控制的原因使本站活动服务无法及时提供或无法按本协议进行的，京东会合理地尽力协助处理善后事宜。</p><p>7.3用户除遵守该用户协议外，仍应同时遵守《京东用户注册协议》。</p><p>7.4试用期自用户开通之日起，最长30天后自动终止。</p><p><b>7.5如用户购买PLUS联名卡，领取权益则视为同意并遵守联名会员用户协议。</b></p><p><b>7.6本协议内容中以黑体、加粗、下划线、斜体等方式显著标识的条款，请用户着重阅读。</b></p></div><div class="rule-box"><p>协议生效日期：2020年10月30日</p></div></div>'
          }
        },
        849: function(e, t, r) {
          "use strict";
          /*! art-template@runtime | https://github.com/aui/art-template */
          var p = "undefined" != typeof self ? self : "undefined" != typeof window ? window : void 0 !== r.g ? r.g : {}
            , s = Object.create(p)
            , i = /["&'<>]/;
          function S(e) {
            return "string" != typeof e && (e = null == e ? "" : "function" == typeof e ? S(e.call(e)) : JSON.stringify(e)),
              e
          }
          s.$escape = function(e) {
            return function(e) {
              var t = "" + e
                , r = i.exec(t);
              if (!r)
                return e;
              var p = ""
                , s = void 0
                , S = void 0
                , L = void 0;
              for (s = r.index,
                     S = 0; s < t.length; s++) {
                switch (t.charCodeAt(s)) {
                  case 34:
                    L = "&#34;";
                    break;
                  case 38:
                    L = "&#38;";
                    break;
                  case 39:
                    L = "&#39;";
                    break;
                  case 60:
                    L = "&#60;";
                    break;
                  case 62:
                    L = "&#62;";
                    break;
                  default:
                    continue
                }
                S !== s && (p += t.substring(S, s)),
                  S = s + 1,
                  p += L
              }
              return S !== s ? p + t.substring(S, s) : p
            }(S(e))
          }
            ,
            s.$each = function(e, t) {
              if (Array.isArray(e))
                for (var r = 0, p = e.length; r < p; r++)
                  t(e[r], r);
              else
                for (var s in e)
                  t(e[s], s)
            }
            ,
            e.exports = s
        },
        274: function(e, t, r) {
          "use strict";
          e.exports = r(849)
        },
        983: function(e, t) {
          "use strict";
          Object.defineProperty(t, "__esModule", {
            value: !0
          }),
            t.default = void 0;
          var r = function() {
            function e() {
              var e = document.documentElement.clientWidth
                , t = (e = e > 750 ? 750 : e) / 320 * 16;
              document.getElementsByTagName("html")[0].style.fontSize = t.toFixed(2) + "px"
            }
            e(),
              window.addEventListener("resize", e, !1),
              window.addEventListener("orientationchange", e, !1)
          };
          t.default = r
        },
        255: function(e, t, r) {
          "use strict";
          r.r(t)
        }
      }
        , t = {};
      function r(p) {
        var s = t[p];
        if (void 0 !== s)
          return s.exports;
        var i = t[p] = {
          exports: {}
        };
        return e[p](i, i.exports, r),
          i.exports
      }
      r.g = function() {
        if ("object" == typeof globalThis)
          return globalThis;
        try {
          return this || new Function("return this")()
        } catch (e) {
          if ("object" == typeof window)
            return window
        }
      }(),
        r.r = function(e) {
          "undefined" != typeof Symbol && Symbol.toStringTag && Object.defineProperty(e, Symbol.toStringTag, {
            value: "Module"
          }),
            Object.defineProperty(e, "__esModule", {
              value: !0
            })
        }
      ;
      return function() {
        "use strict";
        r(255);
        var e = t(r(545));
        function t(e) {
          return e && e.__esModule ? e : {
            default: e
          }
        }
        (0,
          t(r(983)).default)(),
          document.querySelector(".wrapper").innerHTML = (0,
            e.default)()
      }(),
        {}
    }()
  }
));
